#!/usr/bin/env python3
# -*- coding: utf-8 -*-
PAGE_DATA = {
    "current_user": {
        "name": "管理员",
    },
    "vmlist": [
        {
            "id": 1,
            "name": "公安涉案财物管理系统",
            "ip": "172.100.10.6",
            "ports": "80, 443",
            "cpu": "50",
            "status": "ok",
        },
        {
            "id": 2,
            "name": "公检法信息共享平台",
            "ip": "172.101.9.3",
            "ports": "80",
            "cpu": "35",
            "status": "ok",
        },
        {
            "id": 3,
            "name": "物证管理系统",
            "ip": "172.101.100.2",
            "ports": "22, 80, 445, 8080",
            "cpu": "90",
            "status": "error",
        },
        {
            "id": 4,
            "name": "重点人员管理平台",
            "ip": "172.50.10.6",
            "ports": "80, 443",
            "cpu": "60",
            "status": "ok",
        },
        {
            "id": 5,
            "name": "公安固定资产管理系统",
            "ip": "172.20.10.7",
            "ports": "80, 443, 22",
            "cpu": "25",
            "status": "ok",
        },
        {
            "id": 6,
            "name": "公安后勤装备综合服务平台",
            "ip": "172.100.10.6",
            "ports": "22, 80, 443, 3306",
            "cpu": "60",
            "status": "ok",
        },
        {
            "id": 7,
            "name": "公安群防群治管理平台",
            "ip": "172.10.210.120",
            "ports": "80, 3306, 445",
            "cpu": "72",
            "status": "ok",
        },
        {
            "id": 8,
            "name": "公安装备财务服务平台",
            "ip": "172.10.120.100",
            "ports": "80, 443",
            "cpu": "30",
            "status": "ok",
        },
        {
            "id": 9,
            "name": "交警业务监管回访系统",
            "ip": "172.50.120.3",
            "ports": "80, 3306",
            "cpu": "65",
            "status": "ok",
        },
    ],
    "deploy_list": [
        {
            "name": "涉案财物",
            "desc": "公安涉案财物管理系统",
            "step": "3",
        },
        {
            "name": "物证管理",
            "desc": "公安物证管理系统",
            "step": "3",
        },
        # {
        #     "name": "人员管理",
        #     "desc": "重点人员管理平台",
        #     "step": "3",
        # },
        # {
        #     "name": "驾驶人管理",
        #     "desc": "驾驶人培训学习计时管理系统",
        #     "step": "3",
        # },
        # {
        #     "name": "交警监管",
        #     "desc": "交警业务监管回访系统",
        #     "step": "3",
        # },
        {
            "name": "装财平台",
            "desc": "公安装备财务服务平台",
            "step": "3",
        },
        {
            "name": "企业知识库",
            "desc": "企业内部 Wiki 知识库",
            "step": "3",
        },
        {
            "name": "文档协作",
            "desc": "企业内部文档协作与存储",
            "step": "3",
        },
        {
            "name": "临时论坛",
            "desc": "企业内部临时活动论坛",
            "step": "3",
        },
    ],
}
